#pragma once

// 1.0 Вычисляем наибольший общий делитель чисел a и b.
int gcdRecursion(int a, int b);

// 2.0 Дано натуральное число N > 1. Выведите слово YES, если число N является точной степенью двойки, или слово NO в противном случае.
bool powerOfTwo(int number);

// 3.0 Дано натуральное число N. Выведите все его цифры по одной, в обратном порядке, разделяя их пробелами или новыми строками.
void reverseNumber(int number);

// 1.1 Вычисляем наибольший общий делитель чисел a и b.
int gcd(int a, int b)

// 2.1 Дано натуральное число N > 1. Выведите слово YES, если число N является точной степенью двойки, или слово NO в противном случае.
void powerOfTwo(int number)

// 3.1 Дано натуральное число N.Выведите все его цифры по одной, в прямом порядке, разделяя их пробелами или новыми строками.
void reverseNumber(int number)